Catalogs/Маршруты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Маршруты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Comment>Вариант расчета НДС!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемоеВремяВыездаПоМаршруту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВремяВыездаПоМаршруту</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгружаетсяИзЗоны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчаствуетВТранспортнойСистеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропущенныхНомеровМаршрута</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоВремениВыезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТорговыеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокДоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставкаВСетках</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СтоимостьУслугПоДоставкеТовараНаТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьУслугПоДоставкеТовараНаТТ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеДопТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаДопТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоставкаВСетках_Удалить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДоставкиНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыДоставкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Маршруты/Forms/ФормаКонфликтов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредМаршрут = Неопределено;
	Для Каждого СтрокаТаб Из Параметры.ТаблицаКонфликтов Цикл
		Если ПредМаршрут <> СтрокаТаб.Маршрут Тогда
			СтрокаРодитель = ДеревоКонфликтов.ПолучитьЭлементы().Добавить();
			СтрокаРодитель.Представление = СтрокаТаб.МаршрутПредставление;
			СтрокаРодитель.Маршрут = СтрокаТаб.Маршрут;
		КонецЕсли;
		СтрокаДерево = СтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаДерево.Представление 		= СтрокаТаб.СтруктурнаяЕдиницаПредставление;
		СтрокаДерево.Маршрут 			= СтрокаТаб.Маршрут;
		СтрокаДерево.СтруктурнаяЕдиница = СтрокаТаб.СтруктурнаяЕдиница;
		ПредМаршрут = СтрокаТаб.Маршрут;
	КонецЦикла;
	   
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКонфликтовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(ДеревоКонфликтов.НайтиПоИдентификатору(ВыбраннаяСтрока).Маршрут);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтруктурныеЕдиницыИзМаршрутовСервер()
	
	Для Каждого СтрокаМаршут Из ДеревоКонфликтов.ПолучитьЭлементы() Цикл
		МаршрутОбъект = СтрокаМаршут.Маршрут.ПолучитьОбъект();
		Для Каждого СтрокаСтрукЕдиница Из СтрокаМаршут.ПолучитьЭлементы() Цикл
			КолвоСтрок = МаршрутОбъект.ТорговыеТочки.Количество();
			Для н = 1 По КолвоСтрок Цикл
				Если МаршрутОбъект.ТорговыеТочки[КолвоСтрок - н].СтруктурнаяЕдиница = СтрокаСтрукЕдиница.СтруктурнаяЕдиница Тогда
					МаршрутОбъект.ТорговыеТочки.Удалить(КолвоСтрок - н);
					//+++ AK suvv 2018.11.15 ИП-00020358
					НовСтрока = ТаблицаСЕИзДругихМаршрутов.Добавить();
					НовСтрока.Маршрут            = МаршрутОбъект.Ссылка;
					НовСтрока.СтруктурнаяЕдиница = СтрокаСтрукЕдиница.СтруктурнаяЕдиница;
					//--- AK suvv
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;
		МаршрутОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

//+++ AK suvv 2018.11.15 ИП-00020358
&НаСервере 
Функция ТарифыСЕПоСтарымМаршрутам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_МаршрутыИСЕ.Маршрут,
	|	ВТ_МаршрутыИСЕ.СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВТ_МаршрутыИСЕ
	|ИЗ
	|	&ВТ_МаршрутыИСЕ КАК ВТ_МаршрутыИСЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаршрутыИСЕ.СтруктурнаяЕдиница,
	|	СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.Ставка,
	|	СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.НаличиеДопТарифа,
	|	СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.СтавкаДопТарифа
	|ИЗ
	|	ВТ_МаршрутыИСЕ КАК ВТ_МаршрутыИСЕ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьУслугПоДоставкеТовараНаТТ.СрезПоследних КАК СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних
	|		ПО ВТ_МаршрутыИСЕ.Маршрут = СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.Маршрут
	|			И ВТ_МаршрутыИСЕ.СтруктурнаяЕдиница = СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.ТТ
	|ГДЕ
	|	ЕСТЬNULL(СтоимостьУслугПоДоставкеТовараНаТТСрезПоследних.ТТ, """") <> """"";
	Запрос.УстановитьПараметр("ВТ_МаршрутыИСЕ", ТаблицаСЕИзДругихМаршрутов.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
		
КонецФункции //--- AK suvv

&НаКлиенте
Процедура УдалитьСтруктурныеЕдиницыИзМаршрутов(Команда)
	
	УдалитьСтруктурныеЕдиницыИзМаршрутовСервер();
	//+++ AK suvv 2018.11.15 ИП-00020358
	ПараметрыВозврата = Новый Структура;
	ПараметрыВозврата.Вставить("СтатусОтказа",              Ложь);
	ПараметрыВозврата.Вставить("ТарифыСЕПоСтарымМаршрутам", ТарифыСЕПоСтарымМаршрутам());
	Закрыть(ПараметрыВозврата);
	//--- AK suvv
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьРедактированиеТекущего(Команда)
	
	//+++ AK suvv 2018.11.15 ИП-00020358 
	Закрыть(Новый Структура("СтатусОтказа", Истина));
	//--- AK suvv
	
КонецПроцедуры
